package expert;

public class Exam2 {
	
	public static void main(String[] args) {
	/*	String
		문자"(쌍따옴표) 출력
		* "내 이름은 \"누구"입니다" 출력
		* 비번 두개 입력 받거나 저장해 놓은 변수를 사용하여 두개가 같은지 출력*/

		/*자동 형변환
		int 자동 버림 효과
		* 술값 46000원이 나왔다 3명이 마셨다 1인당 내야할 돈은? 내가 조금이라도 더 낼때
*/
		/*double >> int 변환
		* 108제곱미터는 대략 몇평(정수값)이다
		단, 1평 변환값 :  3.30579제곱미터
		a:b = x:d
		a/b = x/d
		a*d/b = x*/

	/*	if
		* 온도를 입력받아 -3 >> 영하입니다
		* 온도를 입력 받아 -3 >> 영하 3도, 3 >> 3도 입니다
		* 어제 온도(영상/영하)와 오늘 온도를 입력받아 "어제보다  높습니다", "어제보다 낮습니다"
		* 어제보다 2도 낮습니다
		ex: -3, 2 >> 어제보다 5도 높습니다*/

		/*if else
		* 125 -> 입력한 수는 100보다 큰 수이며, 양수이고, 홀수입니다.
		(125 % 2) == 0 // 짝수
*/
/*		반복문 for while
		* 1~n까지 더하기 
		* 1~n까지 짝수만 더하기
		* 종료하고 싶으면 yes를 입력하시오*/

	/*	* 1~10까지 3개씩 옆으로 찍기 - 쇼핑몰 제품목록, 게시글 목록
		1 2 3
		4 5 6
		7 8 9 
		10
		* 100~1까지 중 한번에 10개씩 표시한다면 3번째 덩어리는 어디부터 어디까지인가 - 페이징 */
System.out.println(1);
System.out.println("1");

/*		* 연산>>2 + 4
		int a = 2;
		String s = "+";
		int b = 0;
		0으로 나눌 수 없습니다.*/

/*		String 심화
		* 이름 중 두번째 글자 가리기 : 최*수
		* 전화번호 -와- 사이 가리기, 010-****-1239
		* 응원 전광판 효과  hello world >> hell >> ello*/

/*		배열 심화
		* 배열또는 list에서 최대값 찾기(순수하게 구현)
		* 두번째 최대값 찾기
		* 내림차순으로 정렬하기(큰 수부터 작은 수 순서로)*/
	}
}






















